Revit 2024 API
Color Class
Represents a color in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Color : APIObject
Visual Basic
Public Class Color _
	Inherits APIObject
Visual C++
public ref class Color : public APIObject
Remarks
Colors obtained from some API methods may represent an uninitialized/invalid color. You can identify these using the IsValid property.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Color
See Also
Color Members
Autodesk.Revit.DB Namespace